<!-- add-pr-comment:github_plan -->

# staging/github Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # aws_iam_policy.notification_admin_test_admin_deploy[0] will be created
  + resource "aws_iam_policy" "notification_admin_test_admin_deploy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "notification-admin-test-admin-deploy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:ListImages",
                          + "ecr:DescribeImages",
                          + "ecr:BatchDeleteImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:ca-central-1:239043911459:repository/notify/admin"
                    },
                  + {
                      + Action   = "ecr:GetAuthorizationToken"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "lambda:UpdateFunctionConfiguration",
                          + "lambda:UpdateFunctionCode",
                          + "lambda:PutFunctionConcurrency",
                          + "lambda:GetFunctionConfiguration",
                          + "lambda:GetFunction",
                          + "lambda:CreateFunction",
                          + "lambda:AddPermission",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:lambda:ca-central-1:239043911459:function:notify-admin-pr-*"
                    },
                  + {
                      + Action   = [
                          + "logs:PutRetentionPolicy",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:ca-central-1:239043911459:log-group:/aws/lambda/notify-admin-pr-*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }
  # aws_iam_policy.notification_manifests_helmfile_diff will be created
  + resource "aws_iam_policy" "notification_manifests_helmfile_diff" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "notification-manifests-helmfile-diff"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "eks:DescribeCluster"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:eks:ca-central-1:239043911459:cluster/notification-canada-ca-*"
                    },
                  + {
                      + Action   = "ec2:ExportClientVpnClientConfiguration"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ec2:ca-central-1:239043911459:client-vpn-endpoint/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }
  # aws_iam_policy.notification_manifests_staging_smoke_test[0] will be created
  + resource "aws_iam_policy" "notification_manifests_staging_smoke_test" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "notification-manifests-staging-smoke-test"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObjectAcl",
                          + "s3:PutObject",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::notification-canada-ca-*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }
  # aws_iam_role_policy_attachment.notification_admin_test_admin_deploy[0] will be created
  + resource "aws_iam_role_policy_attachment" "notification_admin_test_admin_deploy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "notification-admin-test-admin-deploy"
    }
  # aws_iam_role_policy_attachment.notification_admin_test_admin_deploy_oidc_plan_policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "notification_admin_test_admin_deploy_oidc_plan_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::239043911459:policy/OIDCPlanPolicy"
      + role       = "notification-admin-test-admin-deploy"
    }
  # aws_iam_role_policy_attachment.notification_admin_test_admin_deploy_read_only[0] will be created
  + resource "aws_iam_role_policy_attachment" "notification_admin_test_admin_deploy_read_only" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
      + role       = "notification-admin-test-admin-deploy"
    }
  # aws_iam_role_policy_attachment.notification_manifests_helmfile_diff will be created
  + resource "aws_iam_role_policy_attachment" "notification_manifests_helmfile_diff" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "notification-manifests-helmfile-diff"
    }
  # aws_iam_role_policy_attachment.notification_manifests_helmfile_diff_oidc_plan_policy will be created
  + resource "aws_iam_role_policy_attachment" "notification_manifests_helmfile_diff_oidc_plan_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::239043911459:policy/OIDCPlanPolicy"
      + role       = "notification-manifests-helmfile-diff"
    }
  # aws_iam_role_policy_attachment.notification_manifests_helmfile_diff_read_only will be created
  + resource "aws_iam_role_policy_attachment" "notification_manifests_helmfile_diff_read_only" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
      + role       = "notification-manifests-helmfile-diff"
    }
  # aws_iam_role_policy_attachment.notification_manifests_staging_smoke_test[0] will be created
  + resource "aws_iam_role_policy_attachment" "notification_manifests_staging_smoke_test" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "notification-manifests-staging-smoke-test"
    }
  # aws_iam_role_policy_attachment.notification_manifests_staging_smoke_test_oidc_plan_policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "notification_manifests_staging_smoke_test_oidc_plan_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::239043911459:policy/OIDCPlanPolicy"
      + role       = "notification-manifests-staging-smoke-test"
    }
  # aws_iam_role_policy_attachment.notification_manifests_staging_smoke_test_read_only[0] will be created
  + resource "aws_iam_role_policy_attachment" "notification_manifests_staging_smoke_test_read_only" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
      + role       = "notification-manifests-staging-smoke-test"
    }
  # module.github_workflow_roles_admin[0].aws_iam_role.this["notification-admin-test-admin-deploy"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:cds-snc/notification-admin:ref:refs/heads/*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::239043911459:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "notification-admin-test-admin-deploy"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
      + inline_policy (known after apply)
    }
  # module.github_workflow_roles_manifests.aws_iam_role.this["notification-manifests-helmfile-diff"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:cds-snc/notification-manifests:ref:refs/heads/*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::239043911459:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "notification-manifests-helmfile-diff"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
      + inline_policy (known after apply)
    }
  # module.github_workflow_roles_manifests.aws_iam_role.this["notification-manifests-staging-smoke-test"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:cds-snc/notification-manifests:ref:refs/heads/*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::239043911459:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "notification-manifests-staging-smoke-test"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
      + inline_policy (known after apply)
    }
Plan: 15 to add, 0 to change, 0 to destroy.

# --- End of Plan 1 ---